{
  "returnMessages": {
    "welcome": "Welcome to the Dungeon. You fell asleep and found yourself here.\nThe only way out is to explore the rooms towards the exit.\nEach door you check out counts as a step.",
    "exit": "Stopping and exiting the game",
    "doorSelection": "You selected door %d",
    "doorNonExistant": "Door %d does not exist. Please pick on that actually exists.",
    "nextRoom": "You entered the next room in the dungeon.",
    "stepCount": "Current step count: %d",
    "help": "These are the available commands in the game:\n{n} - A number to select a door\nsteps - Check out how many steps you have spent on the current dungeon\nquit - stop and exit the game\nhelp - this message",
    "blockedDoor": "This door is blocked from the other side or is a mimick. Nonetheless, you cannot go past it.",
    "commandNonExistant": "This command does not exist",
    "difficultyChoice": "Pick a difficulty to play:\n1 - 15 Rooms\n2 - 20 Room\n3 - 25 Rooms",
    "gameStarted": "You started the game, success.",
    "introduction": "Welcome to Dungeon Escape. Your mission is to escape the dungeon you are currently in.\nPlease select a difficulty in which you wish to play.\nEasy - 10 Rooms\nNormal - 15 Rooms\nHard - 20 Rooms",
    "gameover": "It seems there is no way out of the dungeon, and you died from hunger. Better luck next time!",
    "difficultyEasy": "You selected the easy difficulty, are you that much of a wuss?",
    "difficultyNormal": "Seems like you are a casual player",
    "difficultyHard": "Going for the extreme, eh?",
    "startQuestion": "Do you wish to start the game on this difficulty? Type 'start' todo so, otherwise switch your difficulty",
    "noDifficulty": "You didn't select a difficulty, do that first before proceeding",
    "winmessage": "Congratulations, you escaped the dungeon and are free to roam the world in the endless future!\nType 'continue' to return to the difficulty selection and play a new game!"
  },
  "commands": {
    "exit": "quit",
    "stps": "steps",
    "hlp": "help",
    "start": "start"
  }
}